MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX575F256L.atdf
      <value-group caption="Repeated Start Condition Enable bit (when operating as I2C master)" name="I2C1CON__RSEN">
         <value caption="Initiate Repeated Start condition on SDAx and SCLx pins. Hardware clear at end of master Repeated Start sequence." name="" value="0x1" />
         <value caption="Repeated Start condition not in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop Condition Enable bit (when operating as I2C master)" name="I2C1CON__PEN">
         <value caption="Initiate Stop condition on SDAx and SCLx pins. Hardware clear at end of master Stop sequence." name="" value="0x1" />
         <value caption="Stop condition not in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Enable bit (when operating as I2C master)" name="I2C1CON__RCEN">
         <value caption="Enables Receive mode for I2C. Hardware clear at end of eighth bit of master receive data byte." name="" value="0x1" />
         <value caption="Receive sequence not in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="Acknowledge Sequence Enable bit" name="I2C1CON__ACKEN">
         <value caption="Initiate Acknowledge sequence on SDAx and SCLx pins and transmit ACKDT data bit. Hardware clear at end of master Acknowledge sequence." name="" value="0x1" />
         <value caption="Acknowledge sequence not in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="Acknowledge Data bit (when operating as I2C master, applicable during master receive)" name="I2C1CON__ACKDT">
         <value caption="Send NACK during Acknowledge" name="" value="0x1" />
         <value caption="Send ACK during Acknowledge" name="" value="0x0" />
      </value-group>
      <value-group caption="SCLx Clock Stretch Enable bit (when operating as I2C slave)" name="I2C1CON__STREN">
         <value caption="Enable software or receive clock stretching" name="" value="0x1" />
         <value caption="Disable software or receive clock stretching" name="" value="0x0" />
      </value-group>
      <value-group caption="General Call Enable bit (when operating as I2C slave)" name="I2C1CON__GCEN">
         <value caption="Enable interrupt when a general call address is received in the I2CxRSR(module is enabled for reception)" name="" value="0x1" />
         <value caption="General call address disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="SMBus Input Levels bit" name="I2C1CON__SMEN">
         <value caption="Enable I/O pin thresholds compliant with SMBus specification" name="" value="0x1" />
         <value caption="Disable SMBus input thresholds" name="" value="0x0" />
      </value-group>
      <value-group caption="Disable Slew Rate Control bit" name="I2C1CON__DISSLW">
         <value caption="Slew rate control is disabled" name="" value="0x1" />
         <value caption="Slew rate control is enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="10-bit Slave Address bit" name="I2C1CON__A10M">
         <value caption="I2CxADD is a 10-bit slave address" name="" value="0x1" />
         <value caption="I2CxADD is a 7-bit slave address" name="" value="0x0" />
      </value-group>
      <value-group caption="Strict I 2 C Reserved Address Rule Enable bit" name="I2C1CON__STRICT">
         <value caption="Strict reserved addressing is enforced. Device does not respond to reserved address space or generate addresses in reserved address space." name="" value="0x1" />
         <value caption="Strict I2C Reserved Address Rule is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="SCLx Release Control bit (when operating as I2C slave)" name="I2C1CON__SCLREL">
         <value caption="Release SCLx clock" name="" value="0x1" />
         <value caption="Hold SCLx clock low (clock stretch)" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="I2C1CON__SIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="I2C Enable bit" name="I2C1CON__ON">
         <value caption="Enables the I2C module and configures the SDA and SCL pins as serial port pins" name="" value="0x1" />
         <value caption="Disables the I2C module; all I2C pins are controlled by PORT functions" name="" value="0x0" />
      </value-group>
      <value-group caption="Start Condition Enable bit (when operating as I2C master)" name="I2C2CON__SEN">
         <value caption="Initiate Start condition on SDAx and SCLx pins. Hardware clear at end of master Start sequence." name="" value="0x1" />
         <value caption="Start condition not in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="Repeated Start Condition Enable bit (when operating as I2C master)" name="I2C2CON__RSEN">
         <value caption="Initiate Repeated Start condition on SDAx and SCLx pins. Hardware clear at end of master Repeated Start sequence." name="" value="0x1" />
         <value caption="Repeated Start condition not in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop Condition Enable bit (when operating as I2C master)" name="I2C2CON__PEN">
         <value caption="Initiate Stop condition on SDAx and SCLx pins. Hardware clear at end of master Stop sequence." name="" value="0x1" />
         <value caption="Stop condition not in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Enable bit (when operating as I2C master)" name="I2C2CON__RCEN">
         <value caption="Enables Receive mode for I2C. Hardware clear at end of eighth bit of master receive data byte." name="" value="0x1" />
         <value caption="Receive sequence not in progress" name="" value="0x0" />
      </value-group>
      <value-group caption="Acknowledge Sequence Enable bit" name="I2C2CON__ACKEN">
         <value caption="Initiate Acknowledge sequence on SDAx and SCLx pins and transmit ACKDT data bit. Hardware clear at end of master Acknowledge sequence." name="" value="0x1" />
         <value caption="Acknowledge sequence not in progress" name="" value="0x0" />
      </value-group>
